.LinkForm 'BELVALRKO2' Prototype is 'PLATDOCS'
.Group 'ВАЛЮТНЫЙ РАСХОДНЫЙ КАССОВЫЙ ОРДЕР - РБ'
.NameInList 'МС* Валютный расходный кассовый ордер'
.p 80
.fields
  OurTuneName
  NoDok
  DayOb
  MonthOb
  YearOb
  dbSchetO
  SubOsSch  //if (DopParam = 0, dbKAU, '')
  ObISOValut
  ObSumValut
  ObCursValut
  SumObR
  PodotchetDative
  GroupWrap(NameAll,1,82)
  GroupWrapStr(NameAll,2,82)
  sumplatdocstrr
  Dollar
  GroupWrap(NamePl4,1,81)
  GroupWrapStr(NamePl4,2,81)
  BossNameAbbrev
  MainAccountantAbbrev  //sumplatdocstrr  //Dollar
  DayOb
  MonthOb
  YearOb
  GroupWrap(PassportInfo,1,88)
  GroupWrap(PassportInfo,2,88)
  CashierAbbrev
  page_symb
.endfields

.{
 И                                                                                    Утвержден
                                                                    постановлением Минфина РБ
                                                                           от 29.03.2010 N 3 И8

 И                                                                                Форма N КО-2в

 Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                           ( наименование организации )

  БРАСХОДНЫЙ
 КАССОВЫЙ ОРДЕР N Б @~@@@@@@@@@@@@
 " Д@@ Д"  Д@~@@@@@@@@@@ Д  Д@@@@ Д г.

 ────────────────────────────┬───────────┬───────────────┬──────────────┬────────────┬─────
 Корреспондирующий счет,     │    Код    │    Сумма      │     Курс     │   Сумма    │
  субсчет                    │иностранной│  иностранной  │ белорусского │ рублевого  │
                             │   валюты  │    валюты     │    рубля,    │эквивалента │
                             │           │               │ установленный│иностранной │
                             │           │               │ Национальным │  валюты    │
                             │           │               │   банком     │            │
                             │           │               │  Республики  │            │
                             │           │               │   Беларусь   │            │
 ────────────────────────────┼───────────┼───────────────┼──────────────┼────────────┼──────
.{CheckEnter PLATDOCSCYCLEDOCRASH
.}
.{
    @@@ @@                   │     @~@@@@│    &#&&&&&&&&&│     @#~@@@@@@│ &#&&&&&&&&&│
.}
 ────────────────────────────┴───────────┴───────────────┴──────────────┴────────────┴──────
.{
.}

 Выдать  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                               (фамилия, имя, отчество)
 Основание  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
            Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

 Сумма  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                                      (прописью)
  Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                            (наименование иностранной валюты)

 Приложение  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
             Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д

  БРуководитель Б       ________________________    Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                          (подпись)                    (инициалы, фамилия)
 Б
 Главный бухгалтер Б  ________________________    Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                          (подпись)                    (инициалы, фамилия)

 Получил_________________________
           (подпись получателя)
         " Д@@ Д"  Д@~@@@@@@@@@@ Д  Д@@@@ Д г.

 Предъявлен документ  Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                      (данные о документе, удостоверяющем (подтверждающем)
      Д@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Д
                               личность получателя)

  БВыдал кассир Й     И   ________________________    Д@~@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ М
                   И       (подпись)                   (инициалы, фамилия) И

.{CheckEnter PLATDOCSCYCLEVKASSU
.{CheckEnter PLATDOCSCYCLEMEMO1
.}
.}
.{CheckEnter PLATDOCSCYCLEIZKASSY
.{CheckEnter PLATDOCSCYCLEMEMO2
.}
.}
.{
.{
.{
.}
.}
.}
.if DELIMITERPLAT
 И--------------------------------------------------------------------------------- И
.else
.end
.if PAGESYMBOL
^
.else
.end
.}
.endform
